[
  
    {
        "date": "July 2024 - Present",
        "title": "Wissen Technology",
        "subtitle": "Associate Software Engineer",
        "website": "",
        "details": [
          "Implemented Kafka-based event communication between microservices, enabling a loosely coupled and scalable architecture",
          "Resolved critical production bugs and performance issues, unblocking millions of users and restoring business operations, significantly improving system reliability.",
          "Performed Webstack migration by Dockerizing the multimode application and integrating OAuth authentication for secure connectivity",
           "Modernized legacy Spring applications by upgrading the tech stack (Spring Boot , Java , Gradle), decoupling monolithic Spring application into independent microservices to improve scalability and maintainability and enhancing reusability with Artifactory dependencies."
        ],
        "techStack": [ "Spring Boot", "Angular" , "Kafka", "Jenkins", "Docker" , "Podman"]
      },
  {
    "date": "July 2022 - October 2022",
    "title": "MIBAIO Elmec Smart Automations Pvt Ltd",
    "subtitle": "Software Developer Intern",
    "website": "https://mibaio.in/#/",
    "details": [
      "Developed Mibaio's main app using Flutter , creating pixel perfect,buttery smooth UIs across multiple mobile platforms",
      "Developed a robust AWS DynamoDB backend using AWS Sync API to enchance the functionality and performance of the company's API",
      "Collaborated with the web development team to implement innovative solutions, improving website functionality and user experience to improve Mibaio’s online presence",
      "Gained valuable insights into modern app development practices and contributed to write refactored code."
    ],
    "techStack": ["Flutter", "AWS DynamoDB" , "React.js"]
  },
  {
    "date": "June 2022 - July 2022",
    "title": "REBERT TECHNOLOGIES PVT. LTD",
    "subtitle": "SDE Intern",
    "website": "https://rebert.in/",
    "details": [
      "Worked on Android frontend and backend app development using Flutter, implemented beautiful UIs across the mobile platform.",
      "Collaborated with a cross-functional team to build and deploy Flutter applications",
      "Implemented robust error handling and advanced troubleshooting techniques to ensure smooth system operation and reliability."
    ],
    "techStack": [
      "Flutter",
      "Firebase"
    ]
  }
]
