[
  
    {
        "date": "July 2024 - Present",
        "title": "Wissen Technology",
        "subtitle": "Associate Software Engineer",
        "website": "",
        "details": [
          "Implemented Kafka-based event communication between microservices, enabling a loosely coupled and scalable architecture",
          "Designed and implemented high-impact Delegate Feature for analyst users, integrating critical APIs like /getTaxo and /postTaxo, enabling millions of analysts to seamlessly view and update data with improved accuracy.",
          "Resolved critical bugs and production issues, unblocking millions of users and restoring business operations, significantly improving system reliability.",
          "Gained hands-on experience with Spring Boot, Angular , Docker, Kubernetes, Webstack, while contributing to the modernization of a large-scale legacy Spring application by transitioning it to a contemporary, industry-standard tech stack."
        ],
        "techStack": [ "Spring Boot", "Kafka" , "Angular" , "Jenkins", "Docker" , "Podman"]
      },
  {
    "date": "July 2022 - October 2022",
    "title": "MIBAIO Elmec Smart Automations Pvt Ltd",
    "subtitle": "Software Developer Intern",
    "website": "https://mibaio.in/#/",
    "details": [
      "Developed Mibaio's main app using Flutter , creating pixel perfect,buttery smooth UIs across multiple mobile platforms",
      "Developed a robust AWS DynamoDB backend using AWS Sync API to enchance the functionality and performance of the company's API",
      "Collaborated with the web development team to implement innovative solutions, improving website functionality and user experience to improve Mibaio’s online presence",
      "Integrated MQTT Client with Flutter App and ensured proper workflow of message packets"
    ],
    "techStack": ["Flutter", "AWS DynamoDB" , "Angular"]
  },
  {
    "date": "June 2022 - July 2022",
    "title": "REBERT TECHNOLOGIES PVT. LTD",
    "subtitle": "SDE Intern",
    "website": "https://rebert.in/",
    "details": [
      "Worked on Android frontend and backend app development using Flutter, implemented beautiful UIs across the mobile platform.",
      "Collaborated with a cross-functional team to build and deploy Flutter applications",
      "Implemented robust error handling and advanced troubleshooting techniques to ensure smooth system operation and reliability."
    ],
    "techStack": [
      "Flutter",
      "Firebase"
    ]
  }
]
