[
  
    {
        "date": "July 2024 - Present",
        "title": "Wissen Technology",
        "subtitle": "Associate Software Engineer",
        "website": "",
        "details": [
          "Designed and deployed Kafka-based event-driven communication between Spring Boot microservices, processing over 10,000 daily events, improving system cache refresh time from 10min to 5sec.",
          "Developed and implemented 20+ REST APIs leveraging Spring Boot framework, seamlessly integrating multiple applications and reducing data retrieval time by 40%.",
          "Diagnosed and resolved 30+ critical backend bugs in production, restoring access for millions of users and boosting system uptime by 20%.",
          "Implemented multithreading in Java to handle concurrent tasks efficiently, ensuring the application’s responsiveness during critical operations."
        ],
        "techStack": [ "Spring Boot", "Kafka" , "Angular" , "Snowflake" , "Jenkins", "Docker" , "Podman"]
      },
  {
    "date": "July 2022 - October 2022",
    "title": "MIBAIO Elmec Smart Automations Pvt Ltd",
    "subtitle": "Software Developer Intern",
    "website": "https://play.google.com/store/apps/details?id=com.MIBAiO.mibaio_alpha&hl=en_IN",
    "details": [
      "Developed Mibaio's main app using Flutter , creating pixel perfect,buttery smooth UIs across multiple mobile platforms",
      "Developed a robust AWS DynamoDB backend using AWS Sync API to enchance the functionality and performance of the company's API",
      "Collaborated with the web development team to implement innovative solutions, improving website functionality and user experience to improve Mibaio’s online presence",
      "Integrated MQTT Client with Flutter App and ensured proper workflow of message packets"
    ],
    "techStack": ["Flutter", "AWS DynamoDB" , "Angular"]
  },
  {
    "date": "June 2022 - July 2022",
    "title": "REBERT TECHNOLOGIES PVT. LTD",
    "subtitle": "SDE Intern",
    "website": "https://rebert.in/",
    "details": [
      "Worked on Android frontend and backend app development using Flutter, implemented beautiful UIs across the mobile platform.",
      "Collaborated with a cross-functional team to build and deploy Flutter applications",
      "Implemented robust error handling and advanced troubleshooting techniques to ensure smooth system operation and reliability."
    ],
    "techStack": [
      "Flutter",
      "Firebase"
    ]
  }
]
